In [1]:
import pandas as pd
import numpy as np
import json
import requests
import os
from dotenv import load_dotenv
import pandas as pd
from pandas import json_normalize

### Establecimientos abiertos por período e isla

In [212]:
# Establecimientos abiertos por isla y periodo (mes)
establecimiento = pd.read_csv('data/IBESTAT_Establecimientos abiertos estimados por período e isla.csv', sep = ';')

In [213]:
# Vemos la tabla
establecimiento.head()

  Columna1  ILLES BALEARS Mallorca Menorca Eivissa-Formentera
0  2021M12        131.000       99      10                 21
1  2021M11        168.000      130      12                 26
2  2021M10        779.000      593      54                132
3  2021M09          1.022      702      93                227
4  2021M08          1.090      737     105                248

In [13]:
# Cambiar nombre de columnas
establecimiento_2 = establecimiento.rename(columns={'Columna1':'periodo',
                                                   'ILLES BALEARS':'Baleares'})

In [89]:
# Crear subsets 
establecimiento_baleares = establecimiento_2[['periodo', 'Baleares']]
establecimiento_baleares.insert(1, "IDisla", "1")
establecim_baleares = establecimiento_baleares.rename(columns={'Baleares':'establecimientos'})

In [98]:
establecim_baleares[:3]

   periodo IDisla  establecimientos
0  2021M12      1             131.0
1  2021M11      1             168.0
2  2021M10      1             779.0

In [91]:
establecimiento_pmi = establecimiento_2[['periodo', 'Mallorca']]
establecimiento_pmi.insert(1, "IDisla", "2")
establecim_pmi = establecimiento_pmi.rename(columns={'Mallorca':'establecimientos'})

In [92]:
establecimiento_mah = establecimiento_2[['periodo', 'Menorca']]
establecimiento_mah.insert(1, "IDisla", "3")
establecim_mah = establecimiento_mah.rename(columns={'Menorca':'establecimientos'})

In [93]:
establecimiento_ibz = establecimiento_2[['periodo', 'Eivissa-Formentera']]
establecimiento_ibz.insert(1, "IDisla", "4")
establecim_ibz = establecimiento_ibz.rename(columns={'Eivissa-Formentera':'establecimientos'})

In [95]:
# Unimos todos los subdataframes 
establecim_concat = pd.concat([establecim_baleares, establecim_pmi, establecim_mah, establecim_ibz])
establecim_concat.sample(5)

    periodo IDisla establecimientos
32  2019M04      4               75
5   2021M07      2              695
37  2018M11      3              ...
7   2021M05      4               68
38  2018M10      4              206

In [167]:
# Limpiamos la columna 'periodo' para tener el año y el mes:
establecim_concat['year'], establecim_concat['month'] = establecim_concat["periodo"].str.split('M', 1).str
establecim_ok = establecim_concat.drop(['periodo'], axis = 1)
establecim_ok.sample(10)

<ipython-input-167-90b4482efde0>:2: FutureWarning: Columnar iteration over characters will be deprecated in future releases.
  establecim_concat['year'], establecim_concat['month'] = establecim_concat["periodo"].str.split('M', 1).str

   IDisla establecimientos  year month
1       1            168.0  2021    11
40      3              104  2018    08
35      2              101  2019    01
0       4               21  2021    12
39      1             1.34  2018    09
17      3               66  2020    07
11      3              ...  2021    01
35      1            128.0  2019    01
3       4              227  2021    09
44      3               29  2018    04

In [171]:
# Cambio '...' por NaN:
establecim_ok['establecimientos'] = establecim_ok['establecimientos'].replace(['...'], 'NaN')

In [120]:

def reorganizer(lcolumnas,df,columnanueva):
    df_base = pd.DataFrame(columns = ['periodo', 'IDisla', columnanueva])
    for i in lcolumnas:
        df_uni = df[['periodo', i]]
        df_uni.insert(1, "IDisla", dic_isla[i.lower()])
        df_uni = df_uni.rename(columns={f'{i}':columnanueva})
        df_base = pd.concat([df_base,df_uni])
    return df_base

In [ ]:
column_name = ['ILLES BALEARS', 'Mallorca', 'Menorca',
       'Eivissa-Formentera']

In [105]:
dic_isla = {'illes balears': 1, 'mallorca':2, 'menorca':3,
       'eivissa-formentera':4}

In [ ]:
#establecimiento[establecimiento.columns[0:2]]

### Gasto de los turistas con destino principal las Illes Balears por país de residencia

In [214]:
gasto = pd.read_csv("data/Gasto de los turistas con destino las Illes Balears por periodo y país de residenc.csv", sep=';')#,index_col=0)
gasto.head(5)

,Unnamed: 0,Gasto total (millones de euros),Gasto por persona y día (euros)
0,2021M12,NaN,NaN
1,TOTAL,"162,66","107,97"
2,ESPAÑA (Otras CCAA),"35,28","81,44"
3,EXTRANJERO,"127,38","118,67"
4,(110) Francia,"3,84","106,16"

In [215]:
gasto_ok = gasto.rename(columns={'Unnamed: 0':'País',
                                        'Columna2':'Gasto/persona'})
gasto_ok.insert(1, "Mes/año", "") # Quería crear una columna con el periodo al que hacen referencia
gasto_ok.insert(0, "IDisla", "1") # Todas llevan el id 1 porque todas hacen referencia al total de Baleares. 
gasto_ok.head(5)

,IDisla,País,Mes/año,Gasto total (millones de euros),Gasto por persona y día (euros)
0,1,2021M12,,NaN,NaN
1,1,TOTAL,,"162,66","107,97"
2,1,ESPAÑA (Otras CCAA),,"35,28","81,44"
3,1,EXTRANJERO,,"127,38","118,67"
4,1,(110) Francia,,"3,84","106,16"

In [186]:
gasto_ok.iloc[0]

IDisla                                   1
País                               2021M12
Mes/año
Gasto total (millones de euros)        NaN
Gasto por persona y día (euros)        NaN
Name: 0, dtype: object

In [187]:
count = 0
cambioiloc = 0
listafecha = []
for i,row in gasto_ok.iterrows():
    listafecha.append(gasto_ok.iloc[cambioiloc]["País"])
    count += 1
    
    if count == 12:
        cambioiloc = (i+1)
        count=0

In [188]:
gasto_ok["Mes/año"] = listafecha

In [189]:
gasto_ok.head(5)

,IDisla,País,Mes/año,Gasto total (millones de euros),Gasto por persona y día (euros)
0,1,2021M12,2021M12,NaN,NaN
1,1,TOTAL,2021M12,"162,66","107,97"
2,1,ESPAÑA (Otras CCAA),2021M12,"35,28","81,44"
3,1,EXTRANJERO,2021M12,"127,38","118,67"
4,1,(110) Francia,2021M12,"3,84","106,16"

In [190]:
for i, row in gasto_ok.iterrows():
    if row['País'] in listafecha:
        gasto_ok.drop(i, inplace=True)

In [191]:
gasto_ok

,IDisla,País,Mes/año,Gasto total (millones de euros),Gasto por persona y día (euros)
1,1,TOTAL,2021M12,"162,66","107,97"
2,1,ESPAÑA (Otras CCAA),2021M12,"35,28","81,44"
3,1,EXTRANJERO,2021M12,"127,38","118,67"
4,1,(110) Francia,2021M12,"3,84","106,16"
5,1,(115) Italia,2021M12,...,...
...,...,...,...,...,...
571,1,(126) Alemania,2018M01,"51,89","107,28"
572,1,(132) Suiza,2018M01,...,...
573,1,"Bélgica, Luxemburgo y Países Bajos",2018M01,"6,8","121,56"
574,1,Países nórdicos,2018M01,"8,6","138,68"
575,1,Resto del mundo,2018M01,"12,2","177,38"

In [192]:
gasto_ok2 = gasto_ok[~gasto_ok.País.str.contains('TOTAL')]

In [193]:
gasto_ok2.head(10)

,IDisla,País,Mes/año,Gasto total (millones de euros),Gasto por persona y día (euros)
2,1,ESPAÑA (Otras CCAA),2021M12,"35,28","81,44"
3,1,EXTRANJERO,2021M12,"127,38","118,67"
4,1,(110) Francia,2021M12,"3,84","106,16"
5,1,(115) Italia,2021M12,...,...
6,1,(125) Reino Unido,2021M12,"13,63","110,71"
7,1,(126) Alemania,2021M12,"57,64","133,87"
8,1,(132) Suiza,2021M12,"1,84","138,99"
9,1,"Bélgica, Luxemburgo y Países Bajos",2021M12,"13,28","83,32"
10,1,Países nórdicos,2021M12,...,...
11,1,Resto del mundo,2021M12,"26,2","137,4"

In [194]:
# Se separa la columna de 'Mes/año en dos; year y month'
gasto_ok2['year'], gasto_ok2['month'] = gasto_ok2["Mes/año"].str.split('M', 1).str
gasto_ok3 = gasto_ok2.drop(['Mes/año'], axis = 1)
gasto_ok3.head()

<ipython-input-194-05c51956920f>:2: FutureWarning: Columnar iteration over characters will be deprecated in future releases.
  gasto_ok2['year'], gasto_ok2['month'] = gasto_ok2["Mes/año"].str.split('M', 1).str
<ipython-input-194-05c51956920f>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  gasto_ok2['year'], gasto_ok2['month'] = gasto_ok2["Mes/año"].str.split('M', 1).str

,IDisla,País,Gasto total (millones de euros),Gasto por persona y día (euros),year,month
2,1,ESPAÑA (Otras CCAA),"35,28","81,44",2021,12
3,1,EXTRANJERO,"127,38","118,67",2021,12
4,1,(110) Francia,"3,84","106,16",2021,12
5,1,(115) Italia,...,...,2021,12
6,1,(125) Reino Unido,"13,63","110,71",2021,12

In [163]:
# Cambio de '...' por NaN;

In [200]:
gasto_ok3['Gasto total (millones de euros)'] = gasto_ok3['Gasto total (millones de euros)'].replace(['...'], 'NaN')

In [201]:
gasto_ok3['Gasto por persona y día (euros)'] = gasto_ok3['Gasto por persona y día (euros)'].replace(['...'], 'NaN')

 ### Ingresos por habitación disponible

In [216]:
ingresos_22 = pd.read_csv('data/Ingresos por habitación disponible.csv', sep = ';')
ingresos_22

   Unnamed: 0 Eivissa-Formentera Menorca Mallorca ILLES BALEARS
0     2021M12               32,1    23,3     41,3          38,7
1       TOTAL                NaN     NaN      NaN           NaN
2     2021M11               33,3    23,4     53,3          48,6
3       TOTAL                NaN     NaN      NaN           NaN
4     2021M10               53,8      34     56,9          55,8
..        ...                ...     ...      ...           ...
91      TOTAL                NaN     NaN      NaN           NaN
92    2018M02               34,4    11,7     39,2          37,1
93      TOTAL                NaN     NaN      NaN           NaN
94    2018M01               32,3    17,9     39,1          35,9
95      TOTAL                NaN     NaN      NaN           NaN

[96 rows x 5 columns]

In [ ]:
#ingresos_222 = ingresos_22.drop(['ILLES BALEARS'], axis = 1)

In [ ]:
#ingresos_222.insert(2, 'ID1', '1')
#ingresos_222.insert(4, 'ID2', '2')
#ingresos_222.insert(6, 'ID3', '3')

In [217]:
ingresos_ok = ingresos_22.rename(columns={'Unnamed: 0':'periodo'})
ingresos_ok.head()

    periodo Eivissa-Formentera Menorca Mallorca ILLES BALEARS
0   2021M12               32,1    23,3     41,3          38,7
1     TOTAL                NaN     NaN      NaN           NaN
2   2021M11               33,3    23,4     53,3          48,6
3     TOTAL                NaN     NaN      NaN           NaN
4   2021M10               53,8      34     56,9          55,8

In [218]:
ingresos_ok2 = ingresos_ok[~ingresos_ok.periodo.str.contains('TOTAL')]
ingresos_ok2.head()

   periodo Eivissa-Formentera Menorca Mallorca ILLES BALEARS
0  2021M12               32,1    23,3     41,3          38,7
2  2021M11               33,3    23,4     53,3          48,6
4  2021M10               53,8      34     56,9          55,8
6  2021M09              103,4    66,3       74          78,3
8  2021M08              151,3   126,2     84,5         103,3

In [219]:
columnas = ingresos_ok2.columns[1:]

In [220]:
ingresos_funcion = reorganizer(columnas,ingresos_ok2,'ingresos')
ingresos_funcion.sample(10)

    periodo IDisla ingresos
46  2020M01      1     36,4
82  2018M07      4    137,2
20  2021M02      2     12,8
32  2020M08      4     76,7
56  2019M08      3    142,5
22  2021M01      3        8
32  2020M08      3       72
44  2020M02      1     38,8
2   2021M11      3     23,4
68  2019M02      3     19,7

In [221]:
# Se separa la columna de 'Mes/año en dos; year y month'
gasto_ok2['year'], gasto_ok2['month'] = gasto_ok2["Mes/año"].str.split('M', 1).str
gasto_ok3 = gasto_ok2.drop(['Mes/año'], axis = 1)
gasto_ok3.head()

<ipython-input-221-05c51956920f>:2: FutureWarning: Columnar iteration over characters will be deprecated in future releases.
  gasto_ok2['year'], gasto_ok2['month'] = gasto_ok2["Mes/año"].str.split('M', 1).str
<ipython-input-221-05c51956920f>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  gasto_ok2['year'], gasto_ok2['month'] = gasto_ok2["Mes/año"].str.split('M', 1).str

,IDisla,País,Gasto total (millones de euros),Gasto por persona y día (euros),year,month
2,1,ESPAÑA (Otras CCAA),"35,28","81,44",2021,12
3,1,EXTRANJERO,"127,38","118,67",2021,12
4,1,(110) Francia,"3,84","106,16",2021,12
5,1,(115) Italia,...,...,2021,12
6,1,(125) Reino Unido,"13,63","110,71",2021,12

In [222]:
ingresos_funcion['year'], ingresos_funcion['month'] = ingresos_funcion['periodo'].str.split('M',1).str
ingresos_ok_1 = ingresos_funcion.drop(['periodo'], axis = 1)
ingresos_ok_1.sample(10)

<ipython-input-222-8e7afcddcbc2>:1: FutureWarning: Columnar iteration over characters will be deprecated in future releases.
  ingresos_funcion['year'], ingresos_funcion['month'] = ingresos_funcion['periodo'].str.split('M',1).str

   IDisla ingresos  year month
56      1    125,5  2019    08
16      1     40,1  2021    04
94      1     35,9  2018    01
22      1     11,8  2021    01
88      3     20,5  2018    04
4       1     55,8  2021    10
0       3     23,3  2021    12
50      3       33  2019    11
38      2       ..  2020    05
32      3       72  2020    08

In [223]:
ingresos_ok_1['ingresos'] = ingresos_ok_1['ingresos'].replace(['..', '....'], 'NaN')
ingresos_ok_1.sample(20)

   IDisla ingresos  year month
20      3     12,9  2021    02
18      1     33,7  2021    03
32      3       72  2020    08
94      3     17,9  2018    01
70      2     37,2  2019    01
26      4     18,4  2020    11
42      4     25,7  2020    03
66      2       43  2019    03
24      2       20  2020    12
66      1     42,1  2019    03
28      2     20,1  2020    10
36      1      NaN  2020    06
92      1     37,1  2018    02
82      4    137,2  2018    07
2       1     48,6  2021    11
40      4        0  2020    04
88      4     53,4  2018    04
86      3       42  2018    05
30      4     32,7  2020    09
58      3    109,3  2019    07

### Tarifa Media Diaria

In [224]:
tarifa = pd.read_csv('data/INE_tarifa_media_diariaADR.csv', sep = ';')
tarifa.head()

  Tipo de dato                    Zonas turísticas  Periodo   Total
0         Dato  Baleares (Illes): Isla De Mallorca  2021M12  106,21
1         Dato  Baleares (Illes): Isla De Mallorca  2021M11   93,28
2         Dato  Baleares (Illes): Isla De Mallorca  2021M10   95,08
3         Dato  Baleares (Illes): Isla De Mallorca  2021M09   110,7
4         Dato  Baleares (Illes): Isla De Mallorca  2021M08  130,82

In [206]:
# Se agrega el ID para cada isla
# tarifa_2 = tarifa["Periodo"].str.split('M', expand = True)
tarifa.insert(2, 'IDisla', [2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2,3,3,3,3,3,3,3,3,3,3,3,3,4,4,4,4,4,4,4,4,4,4,4,4])
tarifa.sample(5)

,Tipo de dato,Zonas turísticas,IDisla,Periodo,Total
17,Dato,Baleares (Illes): Palma - Calvía,2,2021M07,"130,02"
23,Dato,Baleares (Illes): Palma - Calvía,2,2021M01,"83,44"
19,Dato,Baleares (Illes): Palma - Calvía,2,2021M05,"123,36"
37,Dato,Baleares (Illes): Islas De Ibiza-Formentera,4,2021M11,"86,16"
44,Dato,Baleares (Illes): Islas De Ibiza-Formentera,4,2021M04,"81,49"

In [207]:
# Se elimina la columna "Tipo de dato"
tarifa_1 = tarifa.drop(["Tipo de dato", "Zonas turísticas"], axis = 1)
tarifa_1.head(5)

   IDisla  Periodo   Total
0       2  2021M12  106,21
1       2  2021M11   93,28
2       2  2021M10   95,08
3       2  2021M09   110,7
4       2  2021M08  130,82

In [208]:
# Se separa la columna de 'Periodo' en dos; year y month'
tarifa_1['year'], tarifa_1['month'] = tarifa_1['Periodo'].str.split('M', 1).str
tarifa_ok = tarifa_1.drop(['Periodo'], axis = 1)
tarifa_ok.sample(5)

<ipython-input-208-601724e0250b>:2: FutureWarning: Columnar iteration over characters will be deprecated in future releases.
  tarifa_1['year'], tarifa_1['month'] = tarifa_1['Periodo'].str.split('M', 1).str

    IDisla   Total  year month
12       2  112,06  2021    12
1        2   93,28  2021    11
19       2  123,36  2021    05
14       2  106,93  2021    10
29       3  152,91  2021    07

#### RESUMEN DATOS - TABLAS

In [174]:
establecim_ok.sample(10)

   IDisla establecimientos  year month
15      3               57  2020    09
17      1            564.0  2020    07
45      1            309.0  2018    03
22      2              164  2020    02
16      2              411  2020    08
44      1            621.0  2018    04
40      1            1.342  2018    08
1       1            168.0  2021    11
29      3              103  2019    07
5       1            1.029  2021    07

In [202]:
gasto_ok3.head(10)

,IDisla,País,Gasto total (millones de euros),Gasto por persona y día (euros),year,month
2,1,ESPAÑA (Otras CCAA),"35,28","81,44",2021,12
3,1,EXTRANJERO,"127,38","118,67",2021,12
4,1,(110) Francia,"3,84","106,16",2021,12
5,1,(115) Italia,NaN,NaN,2021,12
6,1,(125) Reino Unido,"13,63","110,71",2021,12
7,1,(126) Alemania,"57,64","133,87",2021,12
8,1,(132) Suiza,"1,84","138,99",2021,12
9,1,"Bélgica, Luxemburgo y Países Bajos","13,28","83,32",2021,12
10,1,Países nórdicos,NaN,NaN,2021,12
11,1,Resto del mundo,"26,2","137,4",2021,12

In [177]:
ingresos_ok_1.sample(10)

   IDisla ingresos  year month
22      4     16,9  2021    01
86      3       42  2018    05
64      1     58,7  2019    04
10      2       78  2021    07
66      2       43  2019    03
86      1     59,6  2018    05
42      3      NaN  2020    03
66      3     23,8  2019    03
72      2     55,8  2018    12
56      4    163,1  2019    08

In [209]:
tarifa_ok.sample(10)

    IDisla   Total  year month
42       4  145,81  2021    06
34       3       .  2021    02
19       2  123,36  2021    05
0        2  106,21  2021    12
33       3   56,45  2021    03
36       4   86,88  2021    12
32       3   65,12  2021    04
31       3   73,94  2021    05
46       4   58,63  2021    02
3        2   110,7  2021    09

In [210]:
tiempo_ok.head(10)

        fecha  IDisla  tmed prec  tmin  tmax  sol
0  2018-01-01       2  15,2  0,0  12,8  17,7  8,1
1  2018-01-02       2  14,2  0,0   9,7  18,6  2,9
2  2018-01-03       2  14,8  0,0  10,0  19,5  3,4
3  2018-01-04       2  15,2  0,0   8,4  22,0  7,8
4  2018-01-05       2  11,1  0,0   4,8  17,4  8,0
5  2018-01-06       2  14,2  2,8  10,4  18,0  1,3
6  2018-01-07       2  10,0  3,9   4,8  15,2  1,4
7  2018-01-08       2   8,1  0,6   3,6  12,6  0,0
8  2018-01-09       2  10,4  0,0   5,3  15,4  5,4
9  2018-01-10       2  11,2  0,5   6,6  15,9  3,6

--------------------------------------

## API AEMET (HISTÓRICO 2018, 2019, 2020, 2021)

In [69]:
url_palma = "https://opendata.aemet.es/opendata/sh/df9ba1ea"

In [76]:
url_menorca = "https://opendata.aemet.es/opendata/sh/381ed95d"

In [81]:
url_ibiza = "https://opendata.aemet.es/opendata/sh/9b1661e5"

In [225]:
def api_get(url):
    load_dotenv()
    tk = os.getenv("token")
    parameters = {"Authorization": f"token {tk}"}
    aem = requests.get(url, params=parameters)
    aem_j = aem.json()
    a = json_normalize(aem_j)
    return (a)

#### MALLORCA

In [71]:
# Datos - Mallorca
pmi = api_get(url_palma)
pmi.head(5)

,fecha,indicativo,nombre,provincia,altitud,tmed,prec,tmin,horatmin,tmax,horatmax,dir,velmedia,racha,horaracha,sol,presMax,horaPresMax,presMin,horaPresMin
0,2018-01-01,B278,"PALMA DE MALLORCA, AEROPUERTO",ILLES BALEARS,8,"15,2","0,0","12,8",07:07,"17,7",21:45,32,"6,7","21,1",00:50,"8,1","1029,2",10,"1021,1",00
1,2018-01-02,B278,"PALMA DE MALLORCA, AEROPUERTO",ILLES BALEARS,8,"14,2","0,0","9,7",06:34,"18,6",12:26,25,"2,5","11,7",02:20,"2,9","1027,0",10,"1023,8",02
2,2018-01-03,B278,"PALMA DE MALLORCA, AEROPUERTO",ILLES BALEARS,8,"14,8","0,0","10,0",01:04,"19,5",14:09,24,"4,4","14,4",14:54,"3,4","1025,6",10,"1022,2",16
3,2018-01-04,B278,"PALMA DE MALLORCA, AEROPUERTO",ILLES BALEARS,8,"15,2","0,0","8,4",23:59,"22,0",13:15,25,"2,8","11,4",14:30,"7,8","1022,6",00,"1016,8",24
4,2018-01-05,B278,"PALMA DE MALLORCA, AEROPUERTO",ILLES BALEARS,8,"11,1","0,0","4,8",05:38,"17,4",13:49,26,"5,3","14,4",Varias,"8,0","1016,8",00,"1007,0",24

In [ ]:
pmi.shape

In [73]:
# Se eliminan todas las columnas que no son necesarias y se agrega el ID de Mallorca
pmi2=pmi.drop(['indicativo','provincia', 'altitud', 'horatmin', 'horatmax', 'dir', 'velmedia', 'racha', 'horaracha', 'presMax', 'horaPresMax', 'presMin', 'horaPresMin'], axis = 1) 
pmi2.insert(2, 'ID', '2')
pmi2

           fecha                         nombre ID  tmed prec  tmin  tmax  sol
0     2018-01-01  PALMA DE MALLORCA, AEROPUERTO  2  15,2  0,0  12,8  17,7  8,1
1     2018-01-02  PALMA DE MALLORCA, AEROPUERTO  2  14,2  0,0   9,7  18,6  2,9
2     2018-01-03  PALMA DE MALLORCA, AEROPUERTO  2  14,8  0,0  10,0  19,5  3,4
3     2018-01-04  PALMA DE MALLORCA, AEROPUERTO  2  15,2  0,0   8,4  22,0  7,8
4     2018-01-05  PALMA DE MALLORCA, AEROPUERTO  2  11,1  0,0   4,8  17,4  8,0
...          ...                            ... ..   ...  ...   ...   ...  ...
1456  2021-12-27  PALMA DE MALLORCA, AEROPUERTO  2  16,0  0,0  10,3  21,7  5,7
1457  2021-12-28  PALMA DE MALLORCA, AEROPUERTO  2  15,6  0,0  10,6  20,5  6,4
1458  2021-12-29  PALMA DE MALLORCA, AEROPUERTO  2  13,4  0,0   7,3  19,5  6,7
1459  2021-12-30  PALMA DE MALLORCA, AEROPUERTO  2  13,1  0,0   7,1  19,1  7,5
1460  2021-12-31  PALMA DE MALLORCA, AEROPUERTO  2   9,0  0,0   5,1  13,0  1,0

[1461 rows x 8 columns]

In [74]:
pmi2.to_csv('data/pmi.csv')

In [75]:
pmidf = pd.read_csv('data/pmi.csv',index_col=0)
pmidf.sample(5)

,fecha,nombre,ID,tmed,prec,tmin,tmax,sol
1308,2021-08-01,"PALMA DE MALLORCA, AEROPUERTO",2,"24,6","0,0","19,5","29,6","10,0"
261,2018-09-19,"PALMA DE MALLORCA, AEROPUERTO",2,"24,6","0,0","19,6","29,7","3,6"
1230,2021-05-15,"PALMA DE MALLORCA, AEROPUERTO",2,"16,2","0,0","9,5","22,8","9,4"
30,2018-01-31,"PALMA DE MALLORCA, AEROPUERTO",2,"9,8","0,0","2,7","16,9","8,7"
528,2019-06-13,"PALMA DE MALLORCA, AEROPUERTO",2,"21,4",Ip,"14,1","28,6","11,4"

#### MENORCA

In [77]:
# Datos - Menorca
mah = api_get(url_menorca)
mah.head()

,fecha,indicativo,nombre,provincia,altitud,tmed,prec,tmin,horatmin,tmax,horatmax,dir,velmedia,racha,horaracha,sol,presMax,horaPresMax,presMin,horaPresMin
0,2018-01-01,B893,"MENORCA, AEROPUERTO",ILLES BALEARS,91,"12,4",Ip,"9,1",07:30,"15,6",14:38,25,"8,1","17,5",18:59,"8,6","1018,1",Varias,"1009,8",00
1,2018-01-02,B893,"MENORCA, AEROPUERTO",ILLES BALEARS,91,"13,0","0,0","8,7",06:55,"17,3",14:16,32,"2,5","12,8",12:22,"5,5","1016,8",Varias,"1012,6",00
2,2018-01-03,B893,"MENORCA, AEROPUERTO",ILLES BALEARS,91,"16,5","0,0","13,3",01:18,"19,7",13:13,30,"4,7","10,8",20:19,"8,0","1015,2",Varias,"1011,7",24
3,2018-01-04,B893,"MENORCA, AEROPUERTO",ILLES BALEARS,91,"16,1","0,0","11,0",22:27,"21,2",11:51,99,"5,0","16,4",Varias,"8,8","1011,7",00,"1007,1",24
4,2018-01-05,B893,"MENORCA, AEROPUERTO",ILLES BALEARS,91,"13,0","0,0","8,3",07:11,"17,6",13:31,23,"5,0","13,3",17:10,"8,0","1007,1",00,"997,8",24

In [78]:
# Se eliminan todas las columnas que no son necesarias y se agrega el ID de Mallorca
mah2=mah.drop(['indicativo','provincia', 'altitud', 'horatmin', 'horatmax', 'dir', 'velmedia', 'racha', 'horaracha', 'presMax', 'horaPresMax', 'presMin', 'horaPresMin'], axis = 1) 
mah2.insert(2, 'ID', '3')
mah2

           fecha               nombre ID  tmed prec  tmin  tmax  sol
0     2018-01-01  MENORCA, AEROPUERTO  3  12,4   Ip   9,1  15,6  8,6
1     2018-01-02  MENORCA, AEROPUERTO  3  13,0  0,0   8,7  17,3  5,5
2     2018-01-03  MENORCA, AEROPUERTO  3  16,5  0,0  13,3  19,7  8,0
3     2018-01-04  MENORCA, AEROPUERTO  3  16,1  0,0  11,0  21,2  8,8
4     2018-01-05  MENORCA, AEROPUERTO  3  13,0  0,0   8,3  17,6  8,0
...          ...                  ... ..   ...  ...   ...   ...  ...
1456  2021-12-27  MENORCA, AEROPUERTO  3  14,8  0,0  10,5  19,0  5,2
1457  2021-12-28  MENORCA, AEROPUERTO  3  14,4  0,0  10,5  18,2  7,9
1458  2021-12-29  MENORCA, AEROPUERTO  3  15,2  0,0  11,8  18,5  7,7
1459  2021-12-30  MENORCA, AEROPUERTO  3  14,7  0,0   9,8  19,6  8,7
1460  2021-12-31  MENORCA, AEROPUERTO  3  12,2  0,0  10,6  13,9  0,2

[1461 rows x 8 columns]

In [79]:
mah2.to_csv('data/mah.csv')

In [80]:
mahdf = pd.read_csv('data/mah.csv',index_col=0)
mahdf.sample(5)

           fecha               nombre  ID  tmed prec  tmin  tmax   sol
1237  2021-05-22  MENORCA, AEROPUERTO   3  17,9   Ip  13,8  22,0  12,1
903   2020-06-22  MENORCA, AEROPUERTO   3  23,0  0,0  18,6  27,4  14,4
461   2019-04-07  MENORCA, AEROPUERTO   3  11,6  5,0   6,8  16,5   4,2
370   2019-01-06  MENORCA, AEROPUERTO   3  12,3  0,0   8,0  16,6   8,9
81    2018-03-23  MENORCA, AEROPUERTO   3  10,8  1,0   5,4  16,1  11,5

#### IBIZA

In [82]:
# Datos - Ibiza
ibz = api_get(url_ibiza)
ibz.head()

,fecha,indicativo,nombre,provincia,altitud,tmed,prec,tmin,horatmin,tmax,horatmax,dir,velmedia,racha,horaracha,sol,presMax,horaPresMax,presMin,horaPresMin
0,2018-01-01,B954,"IBIZA, AEROPUERTO",ILLES BALEARS,6,"13,9","0,0","10,8",07:20,"17,0",11:58,27,"6,9","18,9",00:00,"8,8","1029,8",Varias,"1022,5",00
1,2018-01-02,B954,"IBIZA, AEROPUERTO",ILLES BALEARS,6,"15,4","0,0","13,1",18:36,"17,6",14:54,28,"3,6","16,1",22:17,"7,6","1026,6",Varias,"1024,3",06
2,2018-01-03,B954,"IBIZA, AEROPUERTO",ILLES BALEARS,6,"17,6","0,0","15,2",06:13,"20,0",13:07,29,"5,6","14,4",08:45,"5,9","1026,2",Varias,"1022,5",16
3,2018-01-04,B954,"IBIZA, AEROPUERTO",ILLES BALEARS,6,"18,6","0,0","15,0",04:21,"22,2",12:11,99,"5,3","16,4",Varias,"8,8","1022,8",00,"1015,8",24
4,2018-01-05,B954,"IBIZA, AEROPUERTO",ILLES BALEARS,6,"15,0","0,0","11,8",23:56,"18,1",11:29,26,"4,7","15,0",00:22,"8,9","1015,8",00,"1005,4",24

In [83]:
# Se eliminan todas las columnas que no son necesarias y se agrega el ID de Mallorca
ibz2=mah.drop(['indicativo','provincia', 'altitud', 'horatmin', 'horatmax', 'dir', 'velmedia', 'racha', 'horaracha', 'presMax', 'horaPresMax', 'presMin', 'horaPresMin'], axis = 1) 
ibz2.insert(2, 'ID', '4')
ibz2

           fecha               nombre ID  tmed prec  tmin  tmax  sol
0     2018-01-01  MENORCA, AEROPUERTO  4  12,4   Ip   9,1  15,6  8,6
1     2018-01-02  MENORCA, AEROPUERTO  4  13,0  0,0   8,7  17,3  5,5
2     2018-01-03  MENORCA, AEROPUERTO  4  16,5  0,0  13,3  19,7  8,0
3     2018-01-04  MENORCA, AEROPUERTO  4  16,1  0,0  11,0  21,2  8,8
4     2018-01-05  MENORCA, AEROPUERTO  4  13,0  0,0   8,3  17,6  8,0
...          ...                  ... ..   ...  ...   ...   ...  ...
1456  2021-12-27  MENORCA, AEROPUERTO  4  14,8  0,0  10,5  19,0  5,2
1457  2021-12-28  MENORCA, AEROPUERTO  4  14,4  0,0  10,5  18,2  7,9
1458  2021-12-29  MENORCA, AEROPUERTO  4  15,2  0,0  11,8  18,5  7,7
1459  2021-12-30  MENORCA, AEROPUERTO  4  14,7  0,0   9,8  19,6  8,7
1460  2021-12-31  MENORCA, AEROPUERTO  4  12,2  0,0  10,6  13,9  0,2

[1461 rows x 8 columns]

In [84]:
ibz2.to_csv('data/ibz.csv')
ibzdf = pd.read_csv('data/ibz.csv',index_col=0)
ibzdf.sample(5)

           fecha               nombre  ID  tmed prec  tmin  tmax   sol
26    2018-01-27  MENORCA, AEROPUERTO   4  10,2  5,3   7,3  13,1   0,1
253   2018-09-11  MENORCA, AEROPUERTO   4  25,0  0,0  21,7  28,4   7,2
471   2019-04-17  MENORCA, AEROPUERTO   4  14,1  0,0   9,5  18,7  11,0
1389  2021-10-21  MENORCA, AEROPUERTO   4  20,9   Ip  18,2  23,6   7,1
1242  2021-05-27  MENORCA, AEROPUERTO   4  17,5   Ip  11,6  23,4  10,6

#### Datos del tiempo unidos

In [85]:
tiempo = pd.concat([pmidf,mahdf,ibzdf])
tiempo

,fecha,nombre,ID,tmed,prec,tmin,tmax,sol
0,2018-01-01,"PALMA DE MALLORCA, AEROPUERTO",2,"15,2","0,0","12,8","17,7","8,1"
1,2018-01-02,"PALMA DE MALLORCA, AEROPUERTO",2,"14,2","0,0","9,7","18,6","2,9"
2,2018-01-03,"PALMA DE MALLORCA, AEROPUERTO",2,"14,8","0,0","10,0","19,5","3,4"
3,2018-01-04,"PALMA DE MALLORCA, AEROPUERTO",2,"15,2","0,0","8,4","22,0","7,8"
4,2018-01-05,"PALMA DE MALLORCA, AEROPUERTO",2,"11,1","0,0","4,8","17,4","8,0"
...,...,...,...,...,...,...,...,...
1456,2021-12-27,"MENORCA, AEROPUERTO",4,"14,8","0,0","10,5","19,0","5,2"
1457,2021-12-28,"MENORCA, AEROPUERTO",4,"14,4","0,0","10,5","18,2","7,9"
1458,2021-12-29,"MENORCA, AEROPUERTO",4,"15,2","0,0","11,8","18,5","7,7"
1459,2021-12-30,"MENORCA, AEROPUERTO",4,"14,7","0,0","9,8","19,6","8,7"
1460,2021-12-31,"MENORCA, AEROPUERTO",4,"12,2","0,0","10,6","13,9","0,2"

In [182]:
tiempo = tiempo.rename(columns={'ID':'IDisla'})

In [184]:
# Se elimina la columna de nombre ya que disponemos del ID que indica a que isla se refiere
tiempo_ok=tiempo.drop(['nombre'], axis = 1)
tiempo_ok.head()

        fecha  IDisla  tmed prec  tmin  tmax  sol
0  2018-01-01       2  15,2  0,0  12,8  17,7  8,1
1  2018-01-02       2  14,2  0,0   9,7  18,6  2,9
2  2018-01-03       2  14,8  0,0  10,0  19,5  3,4
3  2018-01-04       2  15,2  0,0   8,4  22,0  7,8
4  2018-01-05       2  11,1  0,0   4,8  17,4  8,0

#### Falta crear una tabla con las islas y su ID:

In [250]:
df = pd.DataFrame()
df['islas'] = ['Illes Baleares', 'Mallorca', 'Menorca', 'Ibiza']
df['IDisla'] = [1,2,3,4]
df

            islas  IDisla
0  Illes Baleares       1
1        Mallorca       2
2         Menorca       3
3           Ibiza       4

### CONECTAR CON SQL - MySQL Connector

In [255]:
import mysql.connector as conn
from sqlalchemy import create_engine

In [256]:
# string de conexion
str_conn='mysql+pymysql://root:ironhack2022.@localhost:3306'

# motor de conexion
motor=create_engine(str_conn)

In [257]:
motor.execute('create database turismo;')

In [258]:
# string de conexion

str_conn='mysql+pymysql://root:ironhack2022.@localhost:3306/turismo'

motor=create_engine(str_conn)

In [259]:
establecim_ok.reset_index()
establecim_ok.to_sql(name='establecimientos', con=motor, index=True)

In [260]:
establecim_ok.reset_index()
gasto_ok3.to_sql(name='gasto', con=motor, index=True)

In [261]:
establecim_ok.reset_index()
ingresos_ok_1.to_sql(name='ingresos', con=motor, index=True)

In [262]:
establecim_ok.reset_index()
tarifa_ok.to_sql(name='tarifa', con=motor, index=True)

In [263]:
establecim_ok.reset_index()
tiempo_ok.to_sql(name='tiempo', con=motor, index=True)

In [264]:
df.reset_index()
df.to_sql(name='islas', con=motor, index=True)

In [265]:
df_sql=pd.read_sql('select * from tarifa', 
                   con=create_engine('mysql+pymysql://root:ironhack2022.@localhost:3306/turismo'))

df_sql.head()

   index  IDisla   Total  year month
0      0       2  106,21  2021    12
1      1       2   93,28  2021    11
2      2       2   95,08  2021    10
3      3       2   110,7  2021    09
4      4       2  130,82  2021    08